Intro to DataFrames

In [49]:
import pandas as pd

In [50]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [51]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A", "B", "C"], index=["x","y","z",'zz'])

In [52]:
print(df)

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [53]:
df = pd.DataFrame([['Apple', 'Pie', 'Juice'], ['Banana', 'Cake', 'Shake'], ['Cucumber', 'Salad','Shake']], columns=['Fruit','Bi-Product 1','Bi-Product 2'], index=['Type0','Type1','Type2'])

In [54]:
df

          Fruit Bi-Product 1 Bi-Product 2
Type0     Apple          Pie        Juice
Type1    Banana         Cake        Shake
Type2  Cucumber        Salad        Shake

In [55]:
df.head()

          Fruit Bi-Product 1 Bi-Product 2
Type0     Apple          Pie        Juice
Type1    Banana         Cake        Shake
Type2  Cucumber        Salad        Shake

In [56]:
df.head(1)

       Fruit Bi-Product 1 Bi-Product 2
Type0  Apple          Pie        Juice

In [57]:
df.tail(2)

          Fruit Bi-Product 1 Bi-Product 2
Type1    Banana         Cake        Shake
Type2  Cucumber        Salad        Shake

In [58]:
df.describe()

        Fruit Bi-Product 1 Bi-Product 2
count       3            3            3
unique      3            3            2
top     Apple          Pie        Shake
freq        1            1            2

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Type0 to Type2
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Fruit         3 non-null      object
 1   Bi-Product 1  3 non-null      object
 2   Bi-Product 2  3 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes

In [60]:
print(df.columns) ##Returns an Index object containing the column names.
print(df.index) ## Returns the Index object representing the row labels.

Index(['Fruit', 'Bi-Product 1', 'Bi-Product 2'], dtype='object')
Index(['Type0', 'Type1', 'Type2'], dtype='object')

In [61]:
df.columns.tolist()

['Fruit', 'Bi-Product 1', 'Bi-Product 2']

In [62]:
df.index.tolist()

['Type0', 'Type1', 'Type2']

In [63]:
df.nunique()

Fruit           3
Bi-Product 1    3
Bi-Product 2    2
dtype: int64

In [64]:
df['Fruit'].unique()

array(['Apple', 'Banana', 'Cucumber'], dtype=object)

In [65]:
df['Bi-Product 2'].unique()

array(['Juice', 'Shake'], dtype=object)

In [66]:
df.shape

(3, 3)

In [67]:
df.size

9

In [68]:
df

          Fruit Bi-Product 1 Bi-Product 2
Type0     Apple          Pie        Juice
Type1    Banana         Cake        Shake
Type2  Cucumber        Salad        Shake

Loading in from Files

In [69]:
coffee= pd.read_csv('/Users/vartika/Downloads/Python/Pandas/data/coffee.csv')

In [74]:
results = pd.read_csv('/Users/vartika/Downloads/Python/Pandas/data/results.csv')

olympics_data = pd.read_excel('/Users/vartika/Downloads/Python/Pandas/data/olympics-data.xlsx', sheet_name="results")

In [75]:
olympics_data

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...,...
308403,2022.0,Winter,Luge,"Singles, Men (Olympic)",Marián Skupek,148983,SVK,NaN,26.0,False,NaN
308404,2022.0,Winter,Alpine Skiing (Skiing),"Slalom, Women (Olympic)",Elsa Fermbäck,148984,SWE,NaN,28.0,False,NaN
308405,2022.0,Winter,Alpine Skiing (Skiing),"Team, Mixed (Olympic)",Hilma Lövblom,148985,SWE,Sweden,13.0,False,NaN
308406,2022.0,Winter,Alpine Skiing (Skiing),"Giant Slalom, Women (Olympic)",Hilma Lövblom,148985,SWE,NaN,NaN,False,NaN
308407,2022.0,Winter,NaN,"Slalom, Women (Olympic)",Charlotta Säfvenberg,148986,NaN,NaN,24.0,False,NaN

In [24]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [25]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [26]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [27]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

In [28]:
coffee.describe()

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

In [29]:
coffee.shape ## Returns a tuple of the form (number of rows, number of columns

(14, 3)

In [30]:
coffee.size ##Returns the total number of elements (rows × columns).

42

In [31]:
coffee.ndim ##Returns the number of dimensions. For a DataFrame, this will always be 2 (rows and columns).

2

In [32]:
coffee.dtypes ##Returns the data types of each column.

Day            object
Coffee Type    object
Units Sold      int64
dtype: object

In [33]:
coffee.values ##Returns a Numpy array representing the DataFrame’s values.

array([['Monday', 'Espresso', 25],
       ['Monday', 'Latte', 15],
       ['Tuesday', 'Espresso', 30],
       ['Tuesday', 'Latte', 20],
       ['Wednesday', 'Espresso', 35],
       ['Wednesday', 'Latte', 25],
       ['Thursday', 'Espresso', 40],
       ['Thursday', 'Latte', 30],
       ['Friday', 'Espresso', 45],
       ['Friday', 'Latte', 35],
       ['Saturday', 'Espresso', 45],
       ['Saturday', 'Latte', 35],
       ['Sunday', 'Espresso', 45],
       ['Sunday', 'Latte', 35]], dtype=object)

In [34]:
coffee.T ##T (Transpose)
## Returns the transpose of the DataFrame (rows become columns and vice versa).

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
Day,Monday,Monday,Tuesday,Tuesday,Wednesday,Wednesday,Thursday,Thursday,Friday,Friday,Saturday,Saturday,Sunday,Sunday
Coffee Type,Espresso,Latte,Espresso,Latte,Espresso,Latte,Espresso,Latte,Espresso,Latte,Espresso,Latte,Espresso,Latte
Units Sold,25,15,30,20,35,25,40,30,45,35,45,35,45,35

In [35]:
coffee.empty ##Returns True if the DataFrame is empty (i.e., no rows or columns).

False

In [36]:
test = ['']

In [37]:
test = pd.DataFrame()

In [38]:
test.empty ##Returns True if the DataFrame is empty (i.e., no rows or columns).

True

In [39]:
coffee.sort_values('Units Sold') ## Default: ASC

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [40]:
coffee.sort_values('Units Sold', ascending=True) ## Explicitly: ASC

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [41]:
coffee.sort_values('Units Sold', ascending=False) ## Explicitly: DESC

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [42]:
pd.__version__

'2.2.3'